0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PCA_1</name>
			<version>A</version>
			<description>None</description>
			<groupName>PCA</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PCA1_IRQn</name>
				<value>26</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>MODE</name>
					<description>Module Operating Mode</description>
					<addressOffset>0x180</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>Input Clock Divisor. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Input Clock (F&lt;subscript&gt;CLKIN&lt;/subscript&gt;) Select. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>APB</name>
									<description>Set the APB as the input clock (FCLKIN).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0</name>
									<description>Set Timer 0 low overflows divided by 2 as the input clock (FCLKIN).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HL_ECI</name>
									<description>Set high-to-low transitions on ECI divided by 2 as the input clock (FCLKIN).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSCN</name>
									<description>Set the external oscillator module output (EXTOSCn) divided by 2 as the input clock (FCLKIN).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECI</name>
									<description>Set ECI transitions divided by 2 as the input clock (FCLKIN).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x190</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OVFIEN</name>
							<description>PCA Counter Overflow/Limit Interrupt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the PCA counter overflow/limit event interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the PCA counter overflow/limit event interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>PCA Debug Mode. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the PCA to halt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN</name>
									<description>The PCA will continue to operate while the core is halted in debug mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVST</name>
							<description>Clock Divider Output State. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OUTPUT_HIGH</name>
									<description>The clock divider is currently in the first half-cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTPUT_LOW</name>
									<description>The clock divider is currently in the second half-cycle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Current Clock Divider Count. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x1a0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>C0CCI</name>
							<description>Channel 0 Capture/Compare Interrupt Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 0 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 0 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1CCI</name>
							<description>Channel 1 Capture/Compare Interrupt Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 1 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 1 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RUN</name>
							<description>Counter/Timer Run. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop the PCA Counter/Timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start the PCA Counter/Timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFI</name>
							<description>Counter/Timer Overflow/Limit Interrupt Flag. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A PCA Counter/Timer overflow/limit event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A PCA Counter/Timer overflow/limit event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C0IOVFI</name>
							<description>Channel 0 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 0 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 0 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1IOVFI</name>
							<description>Channel 1 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 1 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 1 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNTER</name>
					<description>Module Counter/Timer</description>
					<addressOffset>0x1b0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNTER</name>
							<description>Counter/Timer. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LIMIT</name>
					<description>Module Counter/Timer Upper Limit</description>
					<addressOffset>0x1c0</addressOffset>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LIMIT</name>
							<description>Upper Limit. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<!--BASEPOINTER_START_2-->
				<register>
					<name>MODE_0</name>
					<description>Channel Capture/Compare Mode</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COSEL</name>
							<description>Channel Output Function Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle the channel output at the next capture/compare, overflow, or intermediate event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT</name>
									<description>Set the channel output at the next capture/compare, overflow, or intermediate event.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT</name>
									<description>Clear the output at the next capture/compare, overflow, or intermediate event.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>Capture/Compare, overflow, or intermediate events do not control the output state.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMD</name>
							<description>PWM N-Bit Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CMD</name>
							<description>Channel Operating Mode. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EDGE_PWM</name>
									<description>Configure the channel for edge-aligned PWM mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_PWM</name>
									<description>Configure the channel for center-aligned PWM mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HF_SQUARE_WAVE</name>
									<description>Configure the channel for high-frequency/square-wave mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER_CAPTURE</name>
									<description>Configure the channel for timer/capture mode.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_BIT_PWM</name>
									<description>Configure the channel for n-bit edge-aligned PWM mode.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL_0</name>
					<description>Channel Capture/Compare Control</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUTST</name>
							<description>Channel Output State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>The channel output state is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>The channel output state is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCAPEN</name>
							<description>Positive Edge Input Capture Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable positive-edge input capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable positive-edge input capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNCAPEN</name>
							<description>Negative Edge Input Capture Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable negative-edge input capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable negative-edge input capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CUPDCF</name>
							<description>Channel Register Update Complete Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A PCA channel register update completed or is not pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A PCA channel register update has not completed and is still pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCIEN</name>
							<description>Capture/Compare Interrupt Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the channel capture/compare interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the channel capture/compare interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIOVFIEN</name>
							<description>Intermediate Overflow Interrupt Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the channel intermediate overflow interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the channel intermediate overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCAPV_0</name>
					<description>Channel Compare Value</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCAPV</name>
							<description>Channel Compare Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCAPVUPD_0</name>
					<description>Channel Compare Update Value</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCAPVUPD</name>
							<description>Channel Compare Update Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
